# Напишите программу, которая считает сумму, произведение и степень двух чисел.
# Ввод: два целых числа, каждое на отдельной строке.
# Вывод: сумма, произведение и степень, в одну строку через пробел.

a, b = int(input()), int(input())
print(a + b, a * b, a ** b)
