# Песенка "Курочка по зёрнышку" (Im Radio ist ein Kuken).
# С помощью этой песенки маленьких детей учат рекурсии, ну а мы потренируемся писать вложенные циклы.
#     Бабушка, бабушка, купим курочку!
#     Бабушка, бабушка, купим курочку!
#     Курочка по зёрнышку кудах-тах-тах.
#     Бабушка, бабушка, купим уточку! (2 раза)
#     Уточка та-ти-та-та,
#     Курочка по зёрнышку кудах-тах-тах.
# Далее персонажи такие:
# ...индюшонка - Индюшонок фалды-балды,
# ...кисоньку - А кисуня мяу-мяу,
# ...собачонку - Собачонка гав-гав,
# ...коровёнку - Коровёнка муки-муки,
# ...поросёнка - Поросёнок хрюки-хрюки,
# и заканчивается всё последним куплетом:
#     Бабушка, бабушка, купим телевизор! (2 раза)
#     Телевизор надо, надо, ведь у нас такое стадо!
# Примечание. "(2 раза)" - это два раза повторить одну строку.
# Напишите программу, которая генерирует текст песенки.
